[
  {"city":"Los Angeles", "country": "USA", "image":"http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/LA_Skyline_Mountains2.jpg/240px-LA_Skyline_Mountains2.jpg","state":"California","latitude":34.0194,"longitude":-118.4108},
  {"city":"San Francisco","country": "USA", "image":"http://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/San_Francisco_skyline_from_Coit_Tower.jpg/240px-San_Francisco_skyline_from_Coit_Tower.jpg","state":"California","latitude":37.7751,"longitude":-122.4193},
  {"city":"Shanghai","country": "China", "description":"China has always been a destination of different competitions for the HK team. Can’t remember how many times I’ve been to Shanghai — it is also my favourite among that. After some years, I’ve soloed there to see the amazing .  But for China, I’m amazed by the adoption of technology throughout the years — image you can tap and go for a food stall! ", "latitude":31.2304,"longitude":121.4737},
  {"city":"Tokyo", "country": "Japan", "description":"Been there a couple of times for training camps— stunned by the delicious yet healthy melas and Onsen every time! But my favourite memories go to the late night chats about fencing struggle with schools with my best friend/teammate!", "latitude":35.6762,"longitude":139.6503},
  {"city":"Bali", "country": "Indonesia", "description":"Been there only once but it’s my favourite venue! Also, this is the best performance from myself – exceeded myself greatly and completely amazed myself, my coaches and won silver with my teammates! Proudest ever! And of course it’s a place I’ll definitely go back for a beach vacay! ", "latitude":-8.3405,"longitude":115.0920},
  {"city":"Abu Dhabi", "country": "UAE", "description":"Almost gave up fencing in my first year of college – I took the grind balancing out study, fencing and my responsibilities in clubs and societies. All because my little brother reminded me how hard I’ve worked to be where I was at – both to get into my 1st choice of university, and my HK ranking in fencing. This is also the first time we were representing HK together. And of course, we did not skip the chance to visit the Sheikh Zayed Grand Mosque! ", "latitude":24.4539,"longitude":54.3773},
  {"city":"Manama", "country": "Bahrain", "description":"One day after the competitions, we, as in all participants, were dragged to somewhere in the dessert for an Arabic party – serving skewers, Qahwah (Arabic coffee), Lhubz and so on in a huge tent. I was too tired after competitions and couldn’t remember what I’ve eaten or the name of it and all, but the food was excellent and it was an incredibly authentic experience!","latitude":26.2235,"longitude":50.5876},
  {"city":"Brasov", "country": "Romania", "description":"One of the few stops I made while volunteering in Romania. It was also the first time I organised and travelled with a bunch of peers that I just met. Taking care of everyone’s preference and needs with a different cultural background were kinda hard, but it was a hell of an experience and still made an amazing trip (Except that the Bran Castle – Dracula – was closed that entire summer)!", "latitude":45.6427,"longitude":25.5887},
  {"city":"Moscow", "country": "Russia", "description":" First cadet worlds, and I revisited again for solo. It was in the winter and I was stranded on a highway outside of the airport. A couple of people stopped but yet to take me on because of the language barrier. A flight attendant from Aeroflot offered me a ride to a nearby city. And eventually she accompanied me to take the train from the suburb Moscow to the city centre – on a Tuesday night. It was just one of the many helping hands I have been offered in my three-day visit. Meeting people, especially nice people, out of such an exchange, will always be a highlight of a trip!", "latitude":55.7558,"longitude":37.6173},
  {"city":"Tallinn", "country": "Estonia", "description":"The north-east I’ve ever gone. Actually disappointed that it was really snowing as much – I was hoping to make a snow angel. BUT, Christmas Market was fantastic – isn’t the best for no reason!", "latitude": 59.4370,"longitude":24.7536},
  {"city":"Prague", "country":"Czech Republic","description":"Wanted to go to the Ice Pub – but it was too full around Christmas. Me and my friend just ended up hopping from bar to bar. One of the guys who interned/worked in MSFT – I think when he talked about his experience, it actually sparked my curiosity/interest and turned me from a very in exploring a career in tech.","latitude":50.0755,"longitude":14.3478},
  {"city":"Napoli", "country": "Italy", "description":"Graffiti in such a cultural city is just another vibe – it is the kinda vibe that makes you want to caption the most reputable sculpture in the Archaeological Museum with the meme – if you know what I mean. No offence, but wandering around the city, Naples is really an edgy and special European city. I also dare not to challenge pineapple on pizza.",  "latitude":40.8518,"longitude":14.2681},
  {"city":"Milan", "country": "Italy","description":"Photo – Enjoyed sunrise outside a peaceful and travellers-free Duomo di Milano view","latitude":45.4642,"longitude":9.1900},
  {"city":"Da Nang", "country": "Vietnam", "description":"Walked all my way from the airport to the beach – stopped on the way for some very authentic Viet food and – walking around do give you a better look and feel of people’s life in that place.","latitude":16.0545,"longitude":108.0717},
  {"city":"Barcelona", "country": "Spain", "description":"La Sagrada Familia is breath-taking. It tells a story of Gaudi and the modern society. But what I resonate most with Barcelona is the special status of Catalonian, the situation is very similar to my home town. What warmed our heart the most was that a couple of the people I’ve met with my friends there talked about how the umbrella movement in HK have been an inspiration to them. ","latitude":41.3851,"longitude":2.1734},
  {"city":"Madrid", "country": "Spain", "description":"Photo – My favourite thing to do in Europe is always to take a stroll in the parks – vibrant yet historical, this one, the Retiro Park, is my favourite.","latitude":40.4168,"longitude":-3.7038},
  {"city":"Seveille", "country": "Spain","latitude":37.3891,"longitude":-5.9845},
  {"city":"Budapest", "country": "Hungary", "latitude":47.4979,"longitude":19.0402},
  {"city":"Ljubljana", "country": "Slovenia", "latitude":46.0569,"longitude":14.5808},
  {"city":"Merzouga", "country": "Morocco","description":"Photo – The nomads life, Arabic culture and full of stars", "latitude":31.0802,"longitude":-4.0134},
  {"city":"Fes", "country": "Morocco", "description":"Learnt some Jewish wartime wisdom walking in the old town – the best tactics to protect your people overall is to design the city in a way that people will get lost just wandering. When your enemy can’t figure out the direction, they are in jeopardy. Even Google map couldn’t get it all correct.","latitude":34.0181,"longitude":-5.0078},
  {"city":"Rome", "country": "Italy", "description":"Gods and Goddesses were always a thing in stories and movies – that was a huge part of why I was so interested in the Ancient Rome. It’s a blessing to see so many cultural heritages preserved in one place! And it is such a walkable city – perhaps not so much when it is in the middle of summer – I came home literally roasted.","latitude":41.9028,"longitude":12.4964},
  {"city":"Plitivice Lake National Park", "country": "Croatia","latitude":44.8654,"longitude":15.5820},
  {"city":"Dubrovnik", "country": "Croatia","latitude":42.6507,"longitude":18.0944},
  {"city":"Newcastle", "country": "UK", "description":" Visited an old friend who studied in Newcastle after high school in Hong Kong. The conversations we had, made me realise that regardless of how incredibly successful you’ve been, you’ll always bear a greater level of expectations from yourself then others – which I guess was why living in such an international, prosperous yet somehow conservative city is so stressful.", "latitude":54.9783,"longitude":-1.6178},
  {"city":"Bath", "country": "UK","description":"Such a beautiful city – I do reckon myself if one day living in Bath, I’ll start to imagine I’m in a Jane Austen novel or the Downton Abbey. But unfortunately, not enough time spent for a more in-depth cultural visit – I’ll definitely go again!", "latitude":51.3811,"longitude":-2.3590},
  {"city":"London", "country": "UK", "description":"London is always put side-by-side with Hong Kong – perhaps, because of its former identity as a British colony. I do see a lot of similarities in the two city, yet London is more culturally diverse, whereas Hong Kong is really second to none for a good mix of western and eastern vibes. It is so powerful that the UK has preserved so much of its historical content vividly even in the 21st Century – not as a heritage, but something that lives. ", "latitude":51.5074,"longitude":-0.1278},
  {"city":"Manila", "country": "Philippines","description":"First ever AJC – somehow the best results in individual, and bronze for team – also a couple of times for other Asian competitions.","latitude":14.5995,"longitude":120.9842},
  {"city":"Taipei", "country": "Taiwan","latitude":25.0330,"longitude":121.5654},
  {"city":"Osaka", "country": "Japan", "description":"My parents don’t like travelling – I’m the complete opposite. Japan and Taiwan about worthwhile to sit on a flight to travel to. Osaka is one of the very few times that we travel together. It was an amazing time with friends family (if you know what I mean). ","latitude":34.6937,"longitude":135.5023},
  {"city":"Singapore", "country": "Singapore","description":"Met a group of college students on the way back from the Night Safari with my friend – we were craving for dessert, but restaurants close kinda early in Singapore. So we work up the courage to talk to the strangers in the bus. Turns out, we still meet up from time to time whenever they’re visiting in Hong Kong.","latitude":1.3521,"longitude":103.8198},
  {"city":"Bourges", "country": "France", "description":"Last junior worlds – it was the first time I went to a small town and also an European old town! I didn’t even get the chance to go to visit a lot of the places, or there aren’t a lot of “tourist attractions”, but that vibe and perhaps the idea of my last world fencing comp, just made me like the place.", "latitude":47.0810,"longitude":2.3988}
]